[
  {
    "name": "Moving Average Crossover Trend Following",
    "description": "A momentum strategy that identifies trend direction using moving average crossovers. When short-term MA crosses above long-term MA, it signals an uptrend; when it crosses below, it signals a downtrend. Proven effective in trending markets with documented Sharpe ratios of 0.5-1.2 in crypto markets.",
    "markets": ["crypto", "stocks"],
    "data_required": ["historical price data", "volume data", "moving averages (SMA/EMA)"],
    "features": ["SMA(20)", "SMA(50)", "SMA(200)", "volume confirmation", "ADX for trend strength"],
    "entry_logic": "Enter long when SMA(20) crosses above SMA(50) with volume > 1.2x 20-day average AND ADX > 25. Enter short when SMA(20) crosses below SMA(50) with volume confirmation. For stocks, require SMA(50) > SMA(200) for long entries (uptrend filter).",
    "exit_logic": "Exit long when SMA(20) crosses below SMA(50) OR stop-loss at 2% below entry. Exit short when SMA(20) crosses above SMA(50) OR stop-loss at 2% above entry. Trail stop-loss at 1.5x ATR after 3% profit.",
    "risk_rules": "Maximum 2% portfolio risk per trade. Stop-loss mandatory at 2% for crypto, 1.5% for stocks. No new positions if portfolio drawdown > 5%. Reduce position size by 50% if ADX < 20 (weak trend).",
    "position_sizing": "Base position = 2% of portfolio. Adjust by volatility: divide by (ATR(14) / Price). Maximum position size: 5% of portfolio. For crypto, reduce by 30% due to higher volatility.",
    "known_strengths": "Captures large trends effectively. Simple to implement. Backtested Sharpe ratio of 0.8-1.2 in crypto bull markets. Works well in stocks during trending periods (2009-2021 data shows 15-25% annual returns).",
    "known_failures": "Produces false signals in sideways markets (whipsaws). Underperforms in choppy conditions. Crypto: 40-50% of signals may be false in ranging markets. Requires trend filter to reduce drawdowns.",
    "complexity": "low"
  },
  {
    "name": "Bollinger Bands Mean Reversion",
    "description": "Exploits price deviations from moving average using Bollinger Bands (20-period SMA with 2 standard deviations). When price touches lower band with RSI < 30, indicates oversold condition. When price touches upper band with RSI > 70, indicates overbought. Academic papers show 0.6-0.9 Sharpe ratio in range-bound markets.",
    "markets": ["crypto", "stocks"],
    "data_required": ["historical price data", "Bollinger Bands (20, 2)", "RSI(14)", "volume data"],
    "features": ["Bollinger Bands", "RSI(14)", "volume confirmation", "mean reversion signal"],
    "entry_logic": "Enter long when: price touches or crosses below lower Bollinger Band AND RSI < 30 AND volume > 1.1x 20-day average AND price is within 5% of 20-day SMA (not in strong downtrend). Enter short when: price touches or crosses above upper Bollinger Band AND RSI > 70 AND volume confirmation AND price within 5% of 20-day SMA.",
    "exit_logic": "Exit long when price returns to middle Bollinger Band (20-day SMA) OR RSI crosses above 50 OR stop-loss at 1.5% below entry. Exit short when price returns to middle band OR RSI crosses below 50 OR stop-loss at 1.5% above entry.",
    "risk_rules": "Only trade in range-bound markets (ADX < 25). Maximum 1.5% portfolio risk per trade. Stop-loss mandatory. Avoid trading if price is > 5% away from 20-day SMA (trending market). Maximum 3 concurrent mean reversion positions.",
    "position_sizing": "Base position = 1.5% of portfolio. Increase by 20% if RSI is extreme (< 25 or > 75). Decrease by 30% if volume is below average. Maximum position: 3% of portfolio.",
    "known_strengths": "Highly effective in range-bound markets (60-70% win rate in sideways conditions). Low drawdowns when properly filtered. Academic studies show 12-18% annual returns in choppy stock markets. Works well in crypto during consolidation phases.",
    "known_failures": "Fails catastrophically in strong trends. Can produce large losses if price continues beyond bands. Requires strict trend filter. Crypto: false signals increase during high volatility periods (VIX > 30 equivalent).",
    "complexity": "medium"
  },
  {
    "name": "Statistical Arbitrage Pairs Trading",
    "description": "Market-neutral strategy that identifies cointegrated pairs of securities. Uses Engle-Granger or Johansen cointegration tests to find pairs with stable long-term relationship. When spread (price ratio) deviates > 2 standard deviations from mean, enter positions. Academic research shows 0.7-1.5 Sharpe ratio with proper pair selection.",
    "markets": ["stocks", "crypto"],
    "data_required": ["historical price data for pairs", "correlation matrix", "cointegration test results", "spread time series"],
    "features": ["cointegration analysis", "spread z-score", "half-life of mean reversion", "correlation stability"],
    "entry_logic": "For each cointegrated pair (cointegration p-value < 0.05, correlation > 0.7 over 252 days): Enter when spread z-score > 2.0 (long underperformer, short outperformer) OR z-score < -2.0 (short underperformer, long outperformer). Require half-life of mean reversion < 20 days. Entry only if correlation has been stable (rolling 30-day correlation within 0.1 of 252-day correlation).",
    "exit_logic": "Exit when spread z-score returns to 0 (mean) OR z-score crosses 0.5 in opposite direction. Stop-loss if z-score exceeds 3.5 (spread continues to widen). Time-based exit if position held > 30 days without convergence.",
    "risk_rules": "Maximum 3% portfolio risk per pair. Monitor correlation daily - exit if 30-day correlation drops below 0.5. Maximum 10 pairs simultaneously. Stop-loss at z-score = 3.5. No new pairs if portfolio drawdown > 4%.",
    "position_sizing": "Equal dollar amounts in long and short legs. Position size = (portfolio_value * 0.03) / (z-score * spread_volatility). Adjust by inverse of half-life: shorter half-life = larger position. Maximum 5% per pair.",
    "known_strengths": "Market-neutral (reduces market risk). Consistent returns in stable market regimes. Academic papers show 15-25% annual returns with 0.8-1.2 Sharpe. Works well for sector pairs (tech stocks, crypto exchange tokens).",
    "known_failures": "Correlation breakdowns cause large losses (2008 financial crisis, COVID-19). Requires constant monitoring. Pairs can diverge for extended periods. Crypto: higher correlation breakdown risk due to lower market maturity.",
    "complexity": "high"
  },
  {
    "name": "Market Making (Spread Capture)",
    "description": "Provides liquidity by simultaneously placing buy and sell limit orders around the mid-price. Profits from bid-ask spread. Requires sophisticated inventory management to avoid directional exposure. High-frequency market makers achieve 0.5-1.0% daily returns in liquid markets. Crypto exchanges offer maker rebates (0.01-0.05%) which enhance profitability.",
    "markets": ["crypto", "stocks"],
    "data_required": ["real-time order book data", "trade history", "volatility metrics", "spread data"],
    "features": ["order book depth analysis", "inventory management", "spread calculation", "adverse selection detection"],
    "entry_logic": "Place buy limit order at: mid_price - (spread/2) - (0.1 * ATR) for better fill probability. Place sell limit order at: mid_price + (spread/2) + (0.1 * ATR). Adjust orders every 100ms based on new market data. Cancel and replace if inventory imbalance > 2x base position size.",
    "exit_logic": "Orders fill automatically when market participants hit your limit prices. Exit inventory positions when: inventory > 3x base size (reduce by hedging), spread widens > 3x normal (cancel orders), or volatility spike detected (ATR increases > 50% in 5 minutes).",
    "risk_rules": "Maximum inventory = 5% of portfolio per instrument. Hedge inventory if net position > 2x base size. Cancel all orders if spread widens > 5x normal (illiquidity). Stop trading if adverse selection rate > 30% (informed traders taking your prices). Maximum drawdown limit: 2% of portfolio.",
    "position_sizing": "Base order size = 0.5% of portfolio. Adjust by: (normal_spread / current_spread) * (normal_volatility / current_volatility). Reduce size by 50% if inventory imbalance > 1.5x base. Increase size by 20% if spread is wide and volatility is low.",
    "known_strengths": "Consistent small profits. Low directional risk if properly hedged. Crypto: maker rebates provide additional 0.01-0.05% per trade. Works 24/7 in crypto markets. High-frequency version can generate 1000+ trades/day.",
    "known_failures": "Inventory risk during large moves. Adverse selection from informed traders. Requires low-latency infrastructure. Flash crashes can cause large losses. Crypto: exchange outages and API issues cause operational risk.",
    "complexity": "high"
  },
  {
    "name": "Sentiment-Based Trading (NLP)",
    "description": "Uses natural language processing to analyze news articles, social media (Twitter, Reddit), and earnings call transcripts. Quantifies sentiment scores and trades on sentiment shifts. Research shows sentiment strategies achieve 0.4-0.7 Sharpe ratio. Crypto markets show stronger sentiment effects (0.6-0.9 Sharpe) due to retail-driven price movements.",
    "markets": ["crypto", "stocks"],
    "data_required": ["news articles", "social media feeds (Twitter, Reddit)", "sentiment scores", "price data", "volume data"],
    "features": ["VADER sentiment", "BERT-based sentiment", "sentiment momentum", "news volume", "social media mentions"],
    "entry_logic": "Enter long when: 7-day sentiment score > 0.6 (positive) AND sentiment momentum (change in 3-day average) > 0.2 AND news volume > 1.5x 30-day average AND price hasn't already moved > 5% in past 24h (avoid buying the news). Enter short when: sentiment < -0.6 AND negative momentum < -0.2 with high news volume.",
    "exit_logic": "Exit long when sentiment score drops below 0.3 OR sentiment momentum turns negative OR profit target of 3% reached. Exit short when sentiment rises above -0.3 OR positive momentum detected OR 3% profit target. Stop-loss at 2% for crypto, 1.5% for stocks.",
    "risk_rules": "Maximum 2% portfolio risk per sentiment trade. Avoid trading on single news source - require confirmation from multiple sources. Filter out pump-and-dump schemes (crypto): if sentiment spike > 2.0 with low market cap, avoid. Maximum 5 concurrent sentiment positions.",
    "position_sizing": "Base position = 1.5% of portfolio. Increase by 30% if sentiment score is extreme (> 0.8 or < -0.8) AND multiple sources confirm. Decrease by 50% if news volume is low (single source). Maximum position: 3% of portfolio.",
    "known_strengths": "Captures market psychology-driven moves. Can anticipate price movements before technical indicators. Crypto: strong correlation between Reddit/Twitter sentiment and price (0.4-0.6 correlation). Academic papers show 10-15% alpha in event-driven scenarios.",
    "known_failures": "False signals from misinformation and manipulation. Sentiment can be lagging indicator. Crypto: pump-and-dump schemes create false positive sentiment. Requires sophisticated NLP models to filter noise. News sentiment can reverse quickly.",
    "complexity": "high"
  },
  {
    "name": "High-Frequency Trading (Latency Arbitrage)",
    "description": "Exploits microsecond-level price discrepancies across exchanges or between order book updates. Requires co-location, FPGA hardware, and sub-millisecond execution. Profitable market makers achieve 0.1-0.3% daily returns with thousands of trades. Requires significant infrastructure investment ($100K-$1M+).",
    "markets": ["crypto", "stocks"],
    "data_required": ["tick-by-tick price data", "order book updates", "exchange latency data", "trade execution data"],
    "features": ["latency optimization", "order book imbalance detection", "triangular arbitrage", "statistical arbitrage across venues"],
    "entry_logic": "Detect price discrepancy > 0.05% between exchanges (crypto) or between order book updates (stocks). Execute within 1ms: buy on exchange A, sell on exchange B simultaneously. For order book arbitrage: detect large bid/ask imbalance, place orders on thin side, profit when imbalance corrects.",
    "exit_logic": "Positions close automatically within milliseconds as arbitrage opportunity closes. Maximum holding time: 100ms. If position not closed within 500ms, emergency exit at market price.",
    "risk_rules": "Maximum position size: 0.5% of portfolio per trade. Circuit breakers: stop trading if loss > 0.1% in 1 minute. Monitor exchange connectivity - auto-disable if latency > 10ms. Maximum daily loss: 0.5% of portfolio.",
    "position_sizing": "Position size = (arbitrage_spread - transaction_costs) * risk_factor. Risk factor = 0.1 for crypto (higher volatility), 0.2 for stocks. Maximum 1% of portfolio in open arbitrage positions at any time.",
    "known_strengths": "Very consistent small profits. Low directional risk. Can generate 1000+ profitable trades per day. Market-making rebates enhance returns. Crypto: 24/7 market provides constant opportunities.",
    "known_failures": "Requires $100K-$1M+ infrastructure investment. Regulatory scrutiny. Technology risk (exchange outages, API failures). Competition from other HFT firms. Crypto: exchange-specific risks (hacks, regulatory changes).",
    "complexity": "high"
  },
  {
    "name": "Probability Drift Exploitation (Prediction Markets)",
    "description": "Exploits gradual changes in event probabilities over time in prediction markets (Polymarket, Kalshi, Manifold). When market probability drifts significantly from expected trajectory (based on time decay, information flow, or historical patterns), enter positions. Successful traders achieve 15-25% annual returns with 0.6-0.9 Sharpe ratio.",
    "markets": ["prediction markets"],
    "data_required": ["historical probability data", "event timelines", "market volume", "information flow data", "time-to-resolution"],
    "features": ["probability time series", "drift detection", "information asymmetry detection", "time decay modeling", "volume analysis"],
    "entry_logic": "Enter long when: current probability < expected_probability (based on time decay model) by > 10 percentage points AND probability has been drifting upward over 3+ days AND volume is increasing (new information) AND no major news event explains the drift. Enter short when: probability > expected by > 10pp with downward drift and volume confirmation.",
    "exit_logic": "Exit when probability converges to expected trajectory OR probability stabilizes for 2+ days OR event resolution approaches (< 7 days) OR profit target of 15-20% reached. Stop-loss if probability moves > 20pp against position.",
    "risk_rules": "Maximum 2% portfolio risk per event. Diversify across 10-20 events simultaneously. Avoid events with < 30 days to resolution (high time decay risk). Maximum 5% portfolio exposure to single event category (politics, sports, etc.). Exit all positions if portfolio drawdown > 8%.",
    "position_sizing": "Position size = (probability_deviation / 10) * (time_to_resolution / 60) * base_size. Base size = 1% of portfolio. Increase by 50% if volume spike > 2x average. Decrease by 30% if time to resolution < 30 days. Maximum 3% per event.",
    "known_strengths": "Exploits market inefficiencies and slow information incorporation. Polymarket data shows 60-70% of probability drifts > 10pp eventually correct. Works across diverse event types. Lower correlation with traditional markets.",
    "known_failures": "Information asymmetry risk (insiders may know outcomes). Probability can drift further before correcting (require stop-losses). Low liquidity in some markets causes execution issues. Event cancellation risk (refunds at last price, not entry price).",
    "complexity": "medium"
  },
  {
    "name": "Spread Exploitation (Prediction Markets)",
    "description": "Identifies and exploits price discrepancies between related contracts or across prediction market platforms. For example, if 'Trump wins 2024' is 45% on Polymarket but 'Trump wins AND Republicans control Senate' + 'Trump wins AND Democrats control Senate' = 50%, there's an arbitrage opportunity. Also exploits bid-ask spreads in illiquid markets.",
    "markets": ["prediction markets"],
    "data_required": ["contract prices across platforms", "related contract prices", "bid-ask spreads", "market depth", "correlation matrix"],
    "features": ["arbitrage detection", "spread calculation", "synthetic position construction", "liquidity analysis"],
    "entry_logic": "For arbitrage: Enter when synthetic position (long Contract A + short Contract B) has expected value > current market price by > 5% AND both contracts have sufficient liquidity (> $10K volume/day). For spread trading: Place limit orders inside bid-ask spread when spread > 3% and volume is sufficient.",
    "exit_logic": "Arbitrage: Exit when prices converge (spread < 1%) OR at event resolution. Spread trading: Orders fill automatically. Exit inventory positions if spread narrows < 1% (no longer profitable) or if holding > 30 days.",
    "risk_rules": "Maximum 3% portfolio risk per arbitrage opportunity. Require both legs to have > $5K liquidity. Monitor for contract delisting or rule changes. Maximum 5 concurrent arbitrage positions. Stop-loss if spread widens > 10pp against position.",
    "position_sizing": "Position size = min(liquidity_leg_A, liquidity_leg_B) * 0.1 (10% of available liquidity). For spread trading: size = (spread_percentage - 1%) * base_size. Base size = 1% of portfolio. Maximum 4% per opportunity.",
    "known_strengths": "Market-neutral (low directional risk). Consistent profits when opportunities exist. Polymarket data shows 2-5% arbitrage opportunities monthly. Works well in volatile information environments.",
    "known_failures": "Limited opportunities (arbitrage windows close quickly). Execution risk (one leg fills, other doesn't). Contract correlation can break down. Low liquidity causes slippage. Platform-specific risks (Polymarket regulatory issues, Kalshi contract changes).",
    "complexity": "high"
  },
  {
    "name": "Event-Timing Strategy (Prediction Markets)",
    "description": "Exploits mispricings related to event timing and market reactions. Enters positions based on expected timing of events (earnings announcements, election results, sports outcomes) and exits as events approach. Also trades on post-event price movements (markets often overreact initially, then correct). Research shows 0.5-0.8 Sharpe ratio.",
    "markets": ["prediction markets"],
    "data_required": ["event calendars", "historical event outcomes", "market reaction data", "time-to-event", "post-event price data"],
    "features": ["event scheduling", "reaction timing", "overreaction detection", "mean reversion post-event"],
    "entry_logic": "Pre-event: Enter 7-14 days before major event when probability seems mispriced relative to historical similar events. Post-event overreaction: Enter opposite position when probability moves > 15pp immediately after event (market overreaction), expecting mean reversion within 2-5 days.",
    "exit_logic": "Pre-event: Exit 1-2 days before event (avoid resolution risk) OR when probability corrects to expected level. Post-event: Exit when probability reverts 50% toward pre-event level OR after 5 days (overreaction correction window closes). Stop-loss if probability continues moving against position > 10pp.",
    "risk_rules": "Maximum 2.5% portfolio risk per event. Avoid events with uncertain timing (can be delayed/cancelled). Maximum 8 concurrent event-timing positions. Exit all pre-event positions 2 days before resolution (time decay accelerates).",
    "position_sizing": "Pre-event: Base size = 1.5% of portfolio, increase by 30% if timing is highly certain. Post-event: Base size = 2% of portfolio (higher conviction on overreaction correction). Reduce by 40% if event timing is uncertain. Maximum 4% per event.",
    "known_strengths": "Exploits predictable market behavior (overreaction, timing mispricing). Works across diverse events. Post-event mean reversion is well-documented (60-70% of large moves partially reverse). Lower information requirements than drift strategies.",
    "known_failures": "Event timing uncertainty causes losses. Markets may not overreact (genuine information). Pre-event positions face time decay. Execution timing is critical (entering too early/late reduces profits). Some events have permanent probability shifts (no reversion).",
    "complexity": "medium"
  },
  {
    "name": "Dynamic Grid Trading (DGT)",
    "description": "Adaptive grid trading that dynamically resets grid positions based on market volatility and trends. Places buy/sell orders at predefined intervals, but adjusts grid spacing and levels based on ATR and trend direction. Academic paper (arXiv:2506.11921) shows this strategy outperforms static grid trading with 0.7-1.0 Sharpe ratio in crypto markets.",
    "markets": ["crypto"],
    "data_required": ["real-time price data", "ATR(14)", "volatility metrics", "trend indicators"],
    "features": ["dynamic grid spacing", "volatility-adjusted levels", "trend-aware grid placement", "inventory management"],
    "entry_logic": "Place buy orders below current price at intervals of: base_grid_size * (1 + ATR_multiplier). Place sell orders above at same intervals. Grid size = 0.5% * (1 + ATR(14)/Price * 10) for volatile markets, 0.3% for stable. Reset grid center when price moves > 2x grid_size from center (trend detected).",
    "exit_logic": "Orders fill automatically as price hits grid levels. Reset entire grid if: trend detected (price > 3% from grid center), volatility changes > 50%, or inventory imbalance > 3x base position. Close all positions if drawdown > 5%.",
    "risk_rules": "Maximum grid levels: 10 above, 10 below current price. Maximum inventory: 8% of portfolio. Reset grid if inventory > 6% (reduce exposure). Stop trading if ATR increases > 100% in 1 hour (extreme volatility). Maximum drawdown: 6% of portfolio.",
    "position_sizing": "Base order size = 0.8% of portfolio per grid level. Adjust by: (normal_volatility / current_volatility). Reduce size by 40% if inventory imbalance > 2x base. Increase spacing (reduce number of levels) if volatility is high.",
    "known_strengths": "Adapts to changing market conditions better than static grids. Captures profits in ranging and trending markets. Academic backtests show 20-30% annual returns in crypto. Lower drawdowns than static grid (30% reduction).",
    "known_failures": "Still vulnerable to strong trends (grid gets left behind). Requires frequent monitoring and adjustment. Can accumulate large inventory in one direction. Crypto flash crashes can cause large losses if grid isn't reset quickly.",
    "complexity": "medium"
  },
  {
    "name": "Volatility-Based Trading System (VolTS)",
    "description": "Uses volatility clustering and machine learning to predict market trends. Groups stocks by volatility patterns using k-means++ clustering, applies Granger causality tests to identify predictive relationships, then trades based on volatility-forecasted trends. Academic paper (arXiv:2307.13422) shows 0.6-0.9 Sharpe ratio with 15-22% annual returns.",
    "markets": ["stocks"],
    "data_required": ["historical price data", "volatility measures (GARCH, realized vol)", "sector data", "market regime indicators"],
    "features": ["volatility clustering", "k-means clustering", "Granger causality", "regime detection", "ML trend prediction"],
    "entry_logic": "Cluster stocks by volatility patterns. For each cluster, identify leading indicators using Granger causality (p < 0.05). Enter long when: leading indicator shows positive trend AND volatility cluster predicts upward movement AND current volatility is below cluster average (room to expand). Enter short when opposite conditions.",
    "exit_logic": "Exit when predicted trend reverses (ML model signal) OR volatility returns to cluster mean OR stop-loss at 2% for stocks. Time-based exit after 20 days if no clear trend materializes.",
    "risk_rules": "Maximum 2% portfolio risk per position. Diversify across 15-25 stocks from different volatility clusters. Reduce position size by 50% if volatility regime changes (detected by clustering shift). Maximum 30% portfolio in high-volatility cluster stocks.",
    "position_sizing": "Base position = 1.5% of portfolio. Adjust by inverse of volatility: lower vol = larger position. Increase by 30% if Granger causality is strong (p < 0.01). Decrease by 40% if volatility is > 2x cluster average. Maximum 3% per stock.",
    "known_strengths": "Exploits volatility clustering (well-documented phenomenon). ML component adapts to changing patterns. Academic validation shows consistent risk-adjusted returns. Works across different market regimes.",
    "known_failures": "Requires significant computational resources. Model complexity increases overfitting risk. Volatility clusters can break down during regime changes. Requires continuous retraining (monthly).",
    "complexity": "high"
  },
  {
    "name": "Earnings Announcement Drift",
    "description": "Exploits post-earnings announcement drift (PEAD) - the tendency of stock prices to continue moving in the direction of earnings surprises for 60-90 days. Academic research (Bernard & Thomas, 1989) shows this anomaly persists with 0.5-0.7 Sharpe ratio. Works best for small-cap stocks with high analyst coverage dispersion.",
    "markets": ["stocks"],
    "data_required": ["earnings reports", "analyst estimates", "historical price data", "earnings surprise magnitude", "trading volume"],
    "features": ["earnings surprise calculation", "analyst dispersion", "post-announcement returns", "volume analysis"],
    "entry_logic": "Enter long when: earnings surprise > 5% (actual EPS > consensus by 5%+) AND surprise is positive AND volume > 1.5x 30-day average AND stock hasn't already moved > 8% on announcement day (avoid buying the news). Enter short for negative surprises > 5%. Prefer stocks with high analyst dispersion (std dev of estimates > 10% of mean).",
    "exit_logic": "Exit after 60 days (typical drift period) OR when price momentum wanes (5-day return < 0) OR profit target of 8-12% reached. Stop-loss at 4% for long positions, 3% for short (shorts riskier).",
    "risk_rules": "Maximum 2.5% portfolio risk per earnings trade. Avoid earnings within 30 days of previous earnings (overlapping drifts). Maximum 10 concurrent earnings positions. Exit before next earnings announcement (avoid new surprise overriding drift).",
    "position_sizing": "Base position = 2% of portfolio. Increase by 40% if surprise > 10% AND high analyst dispersion. Increase by 20% if volume spike > 2x average. Decrease by 30% if stock already moved > 5% on announcement. Maximum 4% per stock.",
    "known_strengths": "Well-documented academic anomaly (30+ years of evidence). Consistent risk-adjusted returns. Works across market cycles. Small-cap focus provides higher returns (15-25% annual alpha).",
    "known_failures": "Drift can reverse if subsequent news contradicts earnings. Market conditions can override earnings effects. Requires accurate earnings data (restatements cause losses). Less effective for large-cap stocks (more efficient pricing).",
    "complexity": "medium"
  },
  {
    "name": "Reinforcement Learning Pair Trading",
    "description": "Combines reinforcement learning (RL) with traditional pairs trading. RL agent learns optimal entry/exit timing and position sizing through trial and error. Academic paper (arXiv:2407.16103) shows RL-enhanced pairs trading achieves 0.8-1.2 Sharpe ratio vs 0.6-0.9 for traditional pairs trading. Particularly effective in crypto markets.",
    "markets": ["crypto"],
    "data_required": ["historical price data of pairs", "RL training data", "market indicators", "reward signals"],
    "features": ["deep Q-network (DQN)", "policy gradient methods", "dynamic position scaling", "adaptive entry/exit"],
    "entry_logic": "RL agent outputs action: enter_long_short_pair, hold, or exit. Agent considers: spread z-score, spread momentum, correlation stability, market volatility, inventory level. Enter when agent confidence > 0.7 (probability of profitable trade) AND spread z-score > 1.5 (traditional filter still applied).",
    "exit_logic": "Exit when RL agent signals exit (learned optimal exit point) OR traditional exit condition (z-score returns to 0) OR stop-loss triggered. Agent learns to exit earlier in volatile markets, later in stable markets.",
    "risk_rules": "Maximum 3% portfolio risk per pair (same as traditional). RL agent has risk constraints built into reward function. Monitor agent performance - retrain if Sharpe ratio drops below 0.5 for 30 days. Maximum 8 pairs simultaneously.",
    "position_sizing": "RL agent outputs position size multiplier (0.5x to 2.0x base size). Base size = 2% of portfolio. Agent learns optimal sizing based on: spread magnitude, volatility, correlation strength, historical pair performance.",
    "known_strengths": "Adapts to changing market conditions better than static rules. Learns optimal timing (enters earlier, exits at better prices). Academic backtests show 20-30% improvement over traditional pairs trading. Particularly effective in crypto (more patterns to learn).",
    "known_failures": "Requires extensive training data (2+ years). Model can overfit to training period. Requires significant computational resources for training. Performance degrades if market regime changes significantly. Black box nature makes debugging difficult.",
    "complexity": "high"
  },
  {
    "name": "Cross-Exchange Arbitrage (Crypto)",
    "description": "Exploits price discrepancies between cryptocurrency exchanges. When BTC is $50,000 on Binance but $50,500 on Coinbase, buy on Binance and sell on Coinbase simultaneously. Requires fast execution and sufficient balance on both exchanges. Successful arbitrageurs achieve 0.3-0.8% daily returns with proper risk management.",
    "markets": ["crypto"],
    "data_required": ["real-time prices from multiple exchanges", "order book data", "exchange balances", "withdrawal/deposit times", "transaction fees"],
    "features": ["multi-exchange price monitoring", "latency optimization", "fee calculation", "transfer time estimation"],
    "entry_logic": "Detect price discrepancy > (transaction_fees + transfer_costs + 0.1% safety_margin). For example: if spread > 0.3% after fees, execute: buy on Exchange A, sell on Exchange B. Prefer exchanges with fast withdrawal (or existing balance on both).",
    "exit_logic": "Positions close automatically as arbitrage completes (simultaneous buy/sell). If using transfers: exit when funds arrive and trade executes (typically 10-60 minutes for crypto transfers).",
    "risk_rules": "Maximum 5% of portfolio in transit between exchanges. Only arbitrage pairs with > $100K daily volume (liquidity requirement). Avoid during high volatility (> 5% moves in 1 hour) - prices can change during transfer. Maximum 3 concurrent arbitrage opportunities.",
    "position_sizing": "Position size = min(available_balance_exchange_A, available_balance_exchange_B, liquidity_limit). Liquidity limit = 5% of 24h volume to avoid market impact. Maximum 10% of portfolio per arbitrage if using existing balances (no transfer risk).",
    "known_strengths": "Low risk if executed quickly with existing balances. Consistent profits when opportunities exist. Crypto markets have frequent arbitrage opportunities (2-5% spreads common during volatility). Works 24/7.",
    "known_failures": "Transfer times create execution risk (price can change). Exchange outages cause stuck funds. Regulatory risk (some exchanges restrict withdrawals). Requires significant capital on multiple exchanges. Competition from automated bots reduces opportunities.",
    "complexity": "medium"
  },
  {
    "name": "ESG-Driven Pairs Trading",
    "description": "Integrates Environmental, Social, and Governance (ESG) ratings with pairs trading. Selects cointegrated stock pairs that both have favorable ESG ratings, then applies traditional pairs trading logic. Academic paper (arXiv:2401.14761) on Indian market shows this achieves similar returns to traditional pairs (0.7-1.0 Sharpe) while maintaining ESG alignment.",
    "markets": ["stocks"],
    "data_required": ["ESG ratings (MSCI, Sustainalytics)", "historical price data", "cointegration test results", "sector classifications"],
    "features": ["ESG filtering", "cointegration analysis", "spread trading", "sustainability metrics"],
    "entry_logic": "Filter pairs where both stocks have ESG rating > B (or equivalent). Apply cointegration test (p < 0.05). Enter when spread z-score > 2.0, same as traditional pairs trading. Prefer pairs in same sector with similar ESG profiles.",
    "exit_logic": "Exit when spread z-score returns to 0 OR ESG rating of either stock drops below threshold (sustainability breach) OR traditional stop-loss at z-score = 3.5.",
    "risk_rules": "Same as traditional pairs trading (3% max per pair). Additional filter: exit if ESG rating drops > 1 letter grade (e.g., A to B+). Monitor ESG rating changes monthly. Maximum 10 pairs, diversified across sectors.",
    "position_sizing": "Same as traditional pairs trading: equal dollar amounts, adjusted by z-score and half-life. No ESG-specific sizing adjustments (ESG is filter, not sizing factor).",
    "known_strengths": "Maintains ESG alignment while generating returns. Appeals to sustainable investors. Academic validation shows comparable returns to traditional pairs. Can access ESG-focused capital (some funds only invest in ESG strategies).",
    "known_failures": "Smaller universe of pairs (ESG filter reduces opportunities). ESG data quality varies by provider. May underperform if ESG factors don't influence stock prices. Limited to markets with good ESG coverage (developed markets).",
    "complexity": "high"
  }
]

